#include <iostream>
#include <fstream>
using namespace std;

int main() {

	// Отваряме файла и проверяваме дали отварянето е било успешно:
	ifstream fileIn("text.txt");
	if (!fileIn)
	{
		cout << "Couldn't open file!\n";
		return 1;
	}

	// При всяка итерация на цикъла чрез оператора >> извличаме
	// поредната дума от файла (за разделители се приемат всякакви интервали, табулации
	// и други подобни). При всяко успешно извличане увеличаваме променливата wordCounter с 1,
	// като операцията продължава докато се изчерпат всички думи от файла (тогава операцията ще
	// се интерпретира като лъжа и цикълът ще звърши:
	int wordCounter = 0;
	string word;
	while (fileIn >> word) wordCounter++;

	// Променливата съдържа броя на думите във файла:
	cout << wordCounter << endl;

	return 0;
}